// 문제 설명
// 숫자로 이루어진 문자열 t와 p가 주어질 때, t에서 p와 길이가 같은 부분문자열 중에서, 
// 이 부분문자열이 나타내는 수가 p가 나타내는 수보다 작거나 같은 것이 나오는 횟수를 return하는 함수 solution을 완성하세요.

// 예를 들어, t="3141592"이고 p="271" 인 경우, 
// t의 길이가 3인 부분 문자열은 314, 141, 415, 159, 592입니다. 
// 이 문자열이 나타내는 수 중 271보다 작거나 같은 수는 141, 159 2개 입니다.

// 제한사항
// 1 ≤ p의 길이 ≤ 18
// p의 길이 ≤ t의 길이 ≤ 10,000
// t와 p는 숫자로만 이루어진 문자열이며, 0으로 시작하지 않습니다.

// 입출력 예
// t: "3141592", p:	"271", result:	2
// t: "500220839878", p: "7", result: 8
// t: "10203", p:	"15", result: 3

// solution 1)
function solution(t, p) {
    let count = 0; // 작거나 같은 숫자 count
    // t.slice(0,3)
    // t.slice(1,4) 
    // t.slice(2,5) 
    // t.slice(3,6) 
    // t.slice(4,7) 반복
    for(let i = 0; i <= t.length - p.length; i++) {
        if(t.slice(i, i+p.length) <= p) count++
    }
   return count;
}
